harmony.common.security/resources/data/RawReservationRequestWrongEndpoints.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://localhost:8080/harmony-adapter-dummy-sec/services/Reservation</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://ist_phosphorus.eu/nsp/webservice/reservation/createReservation</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:4da7df6f-96a8-1922-3e02-b02eaa15e47a</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <pfx0:createReservation xmlns:pfx0="http://ist_phosphorus.eu/nsp/webservice/reservation">
            <pfx0:createReservation
                xmlns="http://ist_phosphorus.eu/nsp/webservice/topology"
                xmlns:ns2="http://ist_phosphorus.eu/nsp"
                xmlns:ns3="http://ist_phosphorus.eu/nsp/webservice/reservation"
                xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/notification"
                xmlns:ns5="http://docs.oasis-open.org/wsrf/bf-2" xmlns:ns6="http://www.w3.org/2005/08/addressing">
                <ns3:createReservation xmlns:ns3="http://ist_phosphorus.eu/nsp/webservice/reservation">
                    <ns3:Service>
                        <ns3:ServiceID>1</ns3:ServiceID>
                        <ns3:TypeOfReservation>fixed</ns3:TypeOfReservation>
                        <ns3:FixedReservationConstraints>
                            <ns3:StartTime>2008-10-21T11:35:44.787Z</ns3:StartTime>
                            <ns3:Duration>800</ns3:Duration>
                        </ns3:FixedReservationConstraints>
                        <ns3:AutomaticActivation>true</ns3:AutomaticActivation>
                        <ns3:Connections>
                            <ns3:ConnectionID>1</ns3:ConnectionID>
                            <ns3:Source>
                                <ns2:EndpointId xmlns:ns2="http://ist_phosphorus.eu/nsp">1.7.12.2</ns2:EndpointId>
                            </ns3:Source>
                            <ns3:Target>
                                <ns2:EndpointId xmlns:ns2="http://ist_phosphorus.eu/nsp">1.3.17.3</ns2:EndpointId>
                            </ns3:Target>
                            <ns3:Directionality>1</ns3:Directionality>
                            <ns3:MinBW>800</ns3:MinBW>
                            <ns3:MaxBW>800</ns3:MaxBW>
                        </ns3:Connections>
                    </ns3:Service>
                    <ns3:JobID>0</ns3:JobID>
                </ns3:createReservation>
            </pfx0:createReservation>
        </pfx0:createReservation>
    </soap:Body>
</soap:Envelope>
